000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. FIB01.
000300 AUTHOR ROCCO GALIZIO.
000400 
000500 
000600 ENVIRONMENT DIVISION.
000700 DATA DIVISION.
000800 WORKING-STORAGE SECTION.
000900 
       01  WK-PRIMUS         PIC 9(36) VALUE 0.
       01  WK-SECUNDUS       PIC 9(36) VALUE 1.
       01  WK-TERCE          PIC 9(36) VALUE 1.

001000 01  DISPLAY-PRIMUS    PIC ZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZ9.
001100 01  DISPLAY-SECUNDUS  PIC ZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZ9.
001200 01  DISPLAY-TERCE     PIC ZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZ9.

001300 01  WK-ITERATIONS     PIC 9(36) VALUE 1.
001400 01  WK-CHECK          PIC 9(36) VALUE 1.
001400 01  SCREEN-LINES      PIC 99    VALUE 0.
       01  THE-DUMMY         PIC X     VALUE SPACE.
001500
001600 PROCEDURE DIVISION.
001700* Level 1 routines.
001800 PROGRAM-BEGIN.
           PERFORM PROGRAM-START-UP.
001900     PERFORM DISPLAY-SEQUENCE.
002000     
002100     
002200  
002300 PROGRAM-END.
002400     STOP RUN.
002500
      * Level 2 Routines.
       PROGRAM-START-UP.
           DISPLAY "How many iterations of the fibonacci sequence
                    would you like?".
           ACCEPT WK-ITERATIONS.
           MOVE 0 TO DISPLAY-PRIMUS
           MOVE 1 TO DISPLAY-SECUNDUS
           MOVE 1 TO DISPLAY-TERCE.
002600 DISPLAY-SEQUENCE.
002700     DISPLAY "Fibonacci sequence:"
002800     PERFORM CALCULATE-SEQUENCE
               VARYING WK-CHECK
                 FROM 1 BY 1
                 UNTIL WK-CHECK > WK-ITERATIONS.
      * Level 3 Routines
002900 CALCULATE-SEQUENCE.

           IF SCREEN-LINES = 15
               DISPLAY "Please press ENTER to contiue..."
               ACCEPT THE-DUMMY
               MOVE 0 TO SCREEN-LINES.
            
           DISPLAY DISPLAY-PRIMUS " + " DISPLAY-SECUNDUS " = "
                   DISPLAY-TERCE.
003000     MOVE WK-PRIMUS TO WK-SECUNDUS.
           MOVE WK-TERCE TO WK-PRIMUS. 
003100     COMPUTE WK-TERCE = WK-PRIMUS + WK-SECUNDUS.
           MOVE 
             WK-PRIMUS TO DISPLAY-PRIMUS
           MOVE
             WK-SECUNDUS TO DISPLAY-SECUNDUS
           MOVE
             WK-TERCE TO DISPLAY-TERCE.
003200         
           ADD 1 TO SCREEN-LINES.
003300 
003400    
