IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
*> Simple hello world program, my first
ENVIRONMENT DIVISION.
DATA DIVISION.
PROCEDURE DIVISION.

PROGRAM-BEGIN.
    DISPLAY 'Hello world!'.

PROGRAM-DONE.
    STOP RUN.
